tap "oven-sh/bun"
# Distributed revision control system
brew "git"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GitHub command-line tool
brew "gh"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Simple terminal UI for git commands
brew "lazygit"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# AI coding agent, built for the terminal
brew "opencode"
# Open client for Cisco AnyConnect VPN
brew "openconnect"
# Fast, disk space efficient package manager
brew "pnpm"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Watch files and take action when they change
brew "watchman"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Allows connection to a computer remotely
cask "anydesk"
# Voice and text chat software
cask "discord"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox@developer-edition"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Git client focusing on productivity
cask "gitkraken"
# Web browser
cask "google-chrome"
# Chromium-based web browser
cask "helium-browser"
# Open source API development ecosystem
cask "hoppscotch"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# Collaboration platform for API development
cask "postman"
# Team communication and collaboration software
cask "slack"
# Native GUI tool for relational databases
cask "tableplus"
# Web browser
cask "thebrowsercompany-dia"
# Native desktop client for WhatsApp
cask "whatsapp"
# Multiplayer code editor
cask "zed"
